Documents/РемонтыАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РемонтыАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ПоказанияСпидометра</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Машины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтовАвтотранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияСпидометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботПоРемонтуАвтотранспорта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦелоеНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованныеЗапчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запчасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроизводитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФирмаПроизводитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИспользованойЗапчасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИспользованныхЗапчастей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРасходыПоРемонту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РемонтыАвтомобилей/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.РемонтыАвтомобилей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РемонтыАвтомобилей.Автомобиль,
	|	РемонтыАвтомобилей.ВидРемонта,
	|	РемонтыАвтомобилей.Водитель,
	|	РемонтыАвтомобилей.Дата,
	|	РемонтыАвтомобилей.Контрагент,
	|	РемонтыАвтомобилей.Номер,
	|	РемонтыАвтомобилей.ОперацияДокумента,
	|	РемонтыАвтомобилей.Подразделение,
	|	РемонтыАвтомобилей.ПоказанияСпидометра,
	|	РемонтыАвтомобилей.СуммаДокумента,
	|	РемонтыАвтомобилей.ВыполненныеРаботы.(
	|		НомерСтроки,
	|		ВидРабот,
	|		Сумма
	|	),
	|	РемонтыАвтомобилей.ИспользованныеЗапчасти.(
	|		НомерСтроки,
	|		Запчасть,
	|		СтранаПроизводитель,
	|		ФирмаПроизводитель,
	|		Качество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РемонтыАвтомобилей КАК РемонтыАвтомобилей
	|ГДЕ
	|	РемонтыАвтомобилей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполненныеРаботыШапка = Макет.ПолучитьОбласть("ВыполненныеРаботыШапка");
	ОбластьВыполненныеРаботы = Макет.ПолучитьОбласть("ВыполненныеРаботы");
	ОбластьИспользованныеЗапчастиШапка = Макет.ПолучитьОбласть("ИспользованныеЗапчастиШапка");
	ОбластьИспользованныеЗапчасти = Макет.ПолучитьОбласть("ИспользованныеЗапчасти");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыполненныеРаботыШапка);
		ВыборкаВыполненныеРаботы = Выборка.ВыполненныеРаботы.Выбрать();
		Пока ВыборкаВыполненныеРаботы.Следующий() Цикл
			ОбластьВыполненныеРаботы.Параметры.Заполнить(ВыборкаВыполненныеРаботы);
			ТабДок.Вывести(ОбластьВыполненныеРаботы, ВыборкаВыполненныеРаботы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьИспользованныеЗапчастиШапка);
		ВыборкаИспользованныеЗапчасти = Выборка.ИспользованныеЗапчасти.Выбрать();
		Пока ВыборкаИспользованныеЗапчасти.Следующий() Цикл
			ОбластьИспользованныеЗапчасти.Параметры.Заполнить(ВыборкаИспользованныеЗапчасти);
			ТабДок.Вывести(ОбластьИспользованныеЗапчасти, ВыборкаИспользованныеЗапчасти.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
